app/graphql/mutations/clock_out.rb

    def execute(input:)
      error!("You do not have a driver profile", code: "NO_DRIVER_PROFILE") if current_user.driver.blank?

      shift_assignment = current_user.driver.shift_assignments.active.first

      if shift_assignment.nil?
        error!("Shift assignment not found", code: "SHIFT_ASSIGNMENT_NOT_FOUND", field: "shift_assignment_id")
        return empty_response
      end

      unless can_clock_out_of_shift?(shift_assignment)
        error!("You don't have permission to clock out of this shift", code: "PERMISSION_DENIED")
        return empty_response
      end

      if already_clocked_out?(shift_assignment)
        error!("Already clocked out of this shift", code: "ALREADY_CLOCKED_OUT")
        return empty_response
      end

      unless clocked_in?(shift_assignment)
        error!("Must clock in before clocking out", code: "NOT_CLOCKED_IN")
        return empty_response
      end

      shift_event = shift_assignment.shift_events.create!(
        event_type: :clock_out,
        odometer: input[:odometer],
        vehicle_range: input[:vehicle_range],
        gps_lat: input[:gps_lat],
        gps_lon: input[:gps_lon],
        notes: input[:notes]
      )

      # Create revenue record for Bolt if earnings provided
      if input[:bolt_earnings].present?
        RevenueRecord.create!(
          shift_assignment:,
          driver: current_user.driver,
          total_revenue: input[:bolt_earnings],
          source: :bolt
        )
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = 2 LIMIT 1
INSERT INTO "shift_events" ("shift_assignment_id", "event_type", "odometer", "vehicle_range", "gps_lat", "gps_lon", "notes", "created_at", "updated_at") VALUES (11, 1, 51000, 250, NULL, NULL, NULL, '2025-10-23 13:48:33.285009', '2025-10-23 13:48:33.285009') RETURNING "id"
INSERT INTO "revenue_records" ("shift_assignment_id", "driver_id", "total_revenue", "total_profit", "reconciled", "created_at", "updated_at") VALUES (3, 2, 800.0, 600.0, FALSE, '2025-10-23 17:01:55.205324', '2025-10-23 17:01:55.205324') RETURNING "id"

        )
      end

      shift_assignment.update!(status: :completed)
---
UPDATE "shift_assignments" SET "status" = 2, "updated_at" = '2025-10-23 17:01:55.209768' WHERE "shift_assignments"."id" = 3

    def can_clock_out_of_shift?(shift_assignment)
      current_user.driver.present? && current_user.driver.id == shift_assignment.driver.id
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = 1 LIMIT 1

    def already_clocked_out?(shift_assignment)
      shift_assignment.shift_events.exists?(event_type: :clock_out)
---
SELECT 1 AS one FROM "shift_events" WHERE "shift_events"."shift_assignment_id" = 16 AND "shift_events"."event_type" = 0 LIMIT 1