app/graphql/mutations/clock_in.rb

    def execute(vehicle:, input:)
      error!("You do not have a driver profile", code: "NO_DRIVER_PROFILE") if current_user.driver.blank?

      shift_assignment = if input[:shift_assignment_id]
         ShiftAssignment.find_by(id: input[:shift_assignment_id])
      else
        current_user.driver.shift_assignments.scheduled_today.first
      end

      if shift_assignment.nil?
        error!("Shift assignment not found", code: "SHIFT_ASSIGNMENT_NOT_FOUND", field: "shift_assignment_id")
        return empty_response
      end

      unless can_clock_into_shift?(shift_assignment)
        error!("You don't have permission to clock into this shift", code: "PERMISSION_DENIED")
        return empty_response
      end

      if already_clocked_in?(shift_assignment)
        error!("Already clocked in to this shift", code: "ALREADY_CLOCKED_IN")
        return empty_response
      end

      if vehicle_in_use?(vehicle)
        error!("Vehicle is already in use", code: "VEHICLE_IN_USE")
        return empty_response
      end

      shift_event = shift_assignment.shift_events.create!(
        event_type: :clock_in,
        odometer: input[:odometer],
        vehicle_range: input[:vehicle_range],
        gps_lat: input[:gps_lat],
        gps_lon: input[:gps_lon],
        notes: input[:notes]
      )

      shift_assignment.update!(status: :active, vehicle:)
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = 2 LIMIT 1
SELECT "shift_assignments".* FROM "shift_assignments" WHERE "shift_assignments"."id" = 1 LIMIT 1
INSERT INTO "shift_events" ("shift_assignment_id", "event_type", "odometer", "vehicle_range", "gps_lat", "gps_lon", "notes", "created_at", "updated_at") VALUES (3, 0, 8000, 89, -33.910663, 18.4174, NULL, '2025-10-23 13:17:59.016442', '2025-10-23 13:17:59.016442') RETURNING "id"
UPDATE "shift_assignments" SET "vehicle_id" = 1, "status" = 1, "updated_at" = '2025-10-23 13:30:46.258888' WHERE "shift_assignments"."id" = 3

    def can_clock_into_shift?(shift_assignment)
      current_user.driver.present? && current_user.driver.id == shift_assignment.driver.id
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = 1 LIMIT 1

    def already_clocked_in?(shift_assignment)
      shift_assignment.shift_events.exists?(event_type: :clock_in)
---
SELECT 1 AS one FROM "shift_events" WHERE "shift_events"."shift_assignment_id" = 3 AND "shift_events"."event_type" = 0 LIMIT 1