app/graphql/mutations/create_session.rb

    def execute(input:)
      @user = User.find_for_authentication(email: input[:email])
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email" = 'kyonkopa@gmail.com' ORDER BY "users"."id" ASC LIMIT 1