backend/app/graphql/queries/current_shift_query.rb

    def resolve
      return nil unless current_user&.driver

      current_user.driver.shift_assignments.active.first
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = 2 LIMIT 1