backend/app/controllers/graphql_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = 2 LIMIT 1
---
  def authenticate_user
    token = extract_token_from_header
    return nil unless token

    decoded_token = JwtService.decode(token)
    User.find(decoded_token[:user_id])